# LDevice_GetAccCount

## Description
Get the count of accessories attached to a Lighting Device's cell.

```pascal
FUNCTION LDevice_GetAccCount(
				handle    : HANDLE;
				cellIndex : LONGINT): LONGINT;
```

```python
def vs.LDevice_GetAccCount(handle, cellIndex):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE|   |
|cellIndex|LONGINT|   |

## Version
Availability: from Vectorworks 2021

## Category
* Spotlight